turbineTurborCase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0002025;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
  
  cyclic_In1
     {
        type            epsilonWallFunction;
        value           $internalField;
    }
   cyclic_In2
     {
        type            epsilonWallFunction;
        value           $internalField;
    }
  cyclic_Out1
     {
        type            epsilonWallFunction;
        value           $internalField;
    }
    cyclic_Out2
     {
        type            epsilonWallFunction;
        value           $internalField;
    }
    
 }


// ************************************************************************* //
