turbineTurborCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance   	1e-5;
        relTol    	0.01  ;  ;
    }

    p
    {
        $pcorr;
        tolerance     	1e-5; // 1e-05;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        toletance 1e-6;
        relTol 0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;//PBiCGStab;
        smoother	GaussSeidel;
	preconditioner  DILU;
        tolerance     1e-6; // 1e-08;
        relTol         0.01;// 0.0;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;//0;

    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
	p	1;//0.3;
	U	1;//0.8
	k	1;//0.7;
	epsilon	1;;
/*  equations
    {
        ".*"            1;
    }
    */
}


// ************************************************************************* //
