turbineTurborCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Get both sides of ami
    // ~~~~~~~~~~~~~~~~~~~~~

    // Create faceZone for patch couple1
    {
        name    couple1FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple1;
        }
    }
    {
        name    couple1Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple1FaceSet;
        }
    }

    // Create faceZone for patch couple2
    {
        name    couple2FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple2;
        }
    }
    {
        name    couple2Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple2FaceSet;
        }
    }
   // Create cellZone for moving cells in inlet channel
  /*  {
        name    inletChannelCellSet;
        type    cellSet;    //tao cell trong khoi
        action  new;
        source  boxToCell;
        sourceInfo
        {
           // box     (0.0912722 0.000573345 -0.008) (0.13796 0.050978 0.02);
             box     (0.13796 0.050978 0.00154655)(0.0912722 0.000573345 -0.08) ;
        }
    }
*/
    
     {
        name     inletChannelCellSet;
        type    cellSet;    //tao cell trong khoi
        action  new;
        source  regionToCell;
        sourceInfo
        {
           // box     (0.0912722 0.000573345 -0.008) (0.13796 0.050978 0.02);
             insidePoint ((100 20 50));
        }
    }
    {
        name    inletChannel;
        type    cellZoneSet;
        action  new;
        source  setToCellZone; //tu khoi do tao cellzone 
        sourceInfo
        {
            set     inletChannelCellSet;
        }
    }
    
);

// ************************************************************************* //
